app/Controllers/CustomerController.php

    public function index()
    {
        $customerModel = new Customer();
        $userModel = new User();
        $data['root_page'] = ucfirst($this->root);
        $data['customers'] = $customerModel->findAll();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `customers`
SELECT *
FROM `users`

    public function store()
    {
        helper('form');

        $customerModel = new Customer();

        if ($this->request->getMethod() === 'post' && $this->validate([
            'lname' => 'required',
            'fname' => 'required',
            'mobile' => 'required|numeric|min_length[8]|max_length[10]',
            'city' => 'required',
            'selUser' => 'required|numeric',
        ])) {
            // Check for duplicate entry
            $fullname = $this->request->getPost('lname').','.$this->request->getPost('fname');
            $custRec = $customerModel->where('fullname', $fullname)->orWhere('mobileNumber', $this->request->getPost('mobile'))->findAll();
---
SELECT *
FROM `customers`
WHERE `fullname` = 'Yalung,Admin'
OR `mobileNumber` = '9054516861'

                'createdBy' => $this->request->getPost('selUser')
            ];

            $customerModel->insert($data);
---
INSERT INTO `customers` (`firstname`, `lastname`, `fullname`, `mobileNumber`, `city`, `userID`, `createdBy`) VALUES ('Admin', 'Yalung', 'Yalung,Admin', '9054516861', 'Manila City', '1', '1')