app/Controllers/OrderController.php

    public function index()
    {
        $orderModel = new Order();
        $customerModel = new Customer();
        $data['root_page'] = ucfirst($this->root);
        $data['orders'] = $orderModel->findAll();
        foreach ($data['orders'] as $key => $value) {
            $data['orders'][$key]['customer'] = $customerModel->find($value['customerID']);
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = '3'

    public function takeOrder()
    {
        $orderModel = new Order();
        $statusModel = new Status();
        $customerModel = new Customer();
        $skuModel = new SKU();
        $data['root_page'] = ucfirst($this->root);
        $data['status'] = $statusModel->findAll();
        $data['customers'] = $customerModel->where('active', 1)->findAll();
        $data['skus'] = $skuModel->where('active', 1)->findAll();
---
SELECT *
FROM `status`
SELECT *
FROM `customers`
WHERE `active` = 1
SELECT *
FROM `s_k_u_s`
WHERE `active` = 1

    public function editOrder($id = null)
    {
        helper('form');
        $orderModel = new Order();
        $statusModel = new Status();
        $customerModel = new Customer();
        $skuModel = new SKU();
        $itemModel = new Item();

        $data['order'] = $orderModel->find($id);
        $data['skus'] = $skuModel->where('active', 1)->findAll();
        $data['status'] = $statusModel->findAll();
        $data['customers'] = $customerModel->where('active', 1)->find($data['order']['customerID']);
        $data['items'] = $itemModel->where('poID', $data['order']['id'])->findAll();
        foreach ($data['items'] as $key => $value) {
            $data['items'][$key]['skuDet'] = $skuModel->find($value['skuID']);
---
SELECT *
FROM `s_k_u_s`
WHERE `active` = 1
SELECT *
FROM `status`
SELECT *
FROM `customers`
WHERE `active` = 1
AND `customers`.`id` = '2'
SELECT *
FROM `s_k_u_s`
WHERE `s_k_u_s`.`id` = '13'

            if(count($items) > 0) {
                foreach ($items as $item => $value) {
                    $arr = explode('|', $value);
                    $sku = $skuModel->find($arr[0]);
---
SELECT *
FROM `s_k_u_s`
WHERE `s_k_u_s`.`id` = '13'