app/Controllers/SKUController.php

    public function index()
    {
        $skuModel = new SKU();
        $userModel = new User();
        $data['root_page'] = ucfirst($this->root);
        $data['skus'] = $skuModel->findAll();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `s_k_u_s`
SELECT *
FROM `users`

    public function store()
    {
        helper('form');
        $skuModel = new SKU();

        if ($this->request->getMethod() === 'post' && $this->validate([
            'name' => 'required',
            'code' => 'required',
            'price' => 'required|numeric',
            'selUser' => 'required'
        ])) {
            // Check for duplicate entry
            $skuRec = $skuModel->where('name', $this->request->getPost('name'))->orWhere('code', $this->request->getPost('code'))->findAll();
---
SELECT *
FROM `s_k_u_s`
WHERE `name` = 'Access'
OR `code` = 'A1'

                'createdBy' => $this->request->getPost('selUser')
            ];

            $skuModel->insert($data);
---
INSERT INTO `s_k_u_s` (`name`, `code`, `unitPrice`, `img`, `userID`, `createdBy`) VALUES ('Access', 'A1', '400', '1699362043_33ebc2ff2813d5ddd077.png', '1', '1')

    public function edit($id = null)
    {
        $skuModel = new SKU();
        $data = $skuModel->find($id);
---
SELECT *
FROM `s_k_u_s`
WHERE `s_k_u_s`.`id` = '14'